电脑/html5/jquery学习笔记.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-04-18 一 12:33 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>title</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">title</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline8">1. jquery</a>
<ul>
<li><a href="#orgheadline1">1.1. 显示或隐藏</a></li>
<li><a href="#orgheadline6">1.2. 事件</a>
<ul>
<li><a href="#orgheadline2">1.2.1. 鼠标事件</a></li>
<li><a href="#orgheadline3">1.2.2. 键盘事件</a></li>
<li><a href="#orgheadline4">1.2.3. 其他事件</a></li>
<li><a href="#orgheadline5">1.2.4. 取消某个事件绑定</a></li>
</ul>
</li>
<li><a href="#orgheadline7">1.3. ajax函数</a></li>
</ul>
</li>
<li><a href="#orgheadline11">2. json</a>
<ul>
<li><a href="#orgheadline9">2.1. stringify函数</a></li>
<li><a href="#orgheadline10">2.2. parse函数</a></li>
</ul>
</li>
</ul>
</div>
</nav>




<div class="outline-2">
<h2 id="orgheadline8">jquery</h2>
<div class="outline-text-2" id="text-1">
<pre>
$('#abc')
</pre>
<p>
就可以获得类似
</p>
<pre>
document.getElementById('abc')
</pre>
<p>
的效果，注意只是类似。
</p>

<p>
\(实际上是一个函数，其将返回一个数组，里面装着jquery对象（如果没有命中则返回空数组）。你可以用 ~\)(DOMobject)~ 来讲某个javascript原DOM对象转变成为jquery对象。
</p>

<p>
按照多个class查找:
</p>
<pre>
var a = $('.red.green'); // 注意没有空格！
// 符合条件的节点：
// &lt;div class="red green"&gt;...&lt;/div&gt;
// &lt;div class="blue green red"&gt;...&lt;/div&gt;
</pre>

<p>
按照属性查找:
</p>
<pre>
var icons = $('[name^=icon]'); // 找出所有name属性值以icon开头的DOM
// 例如: name="icon-1", name="icon-2"
var names = $('[name$=with]'); // 找出所有name属性值以with结尾的DOM
// 例如: name="startswith", name="endswith"
</pre>

<p>
组合查找
</p>
<pre>
$('p,div'); // 把&lt;p&gt;和&lt;div&gt;都选出来
$('p.red,p.green'); // 把&lt;p class="red"&gt;和&lt;p class="green"&gt;都选出来
</pre>

<p>
层级查找
</p>
<pre>
$('ul.lang li.lang-javascript'); // [&lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;]
$('div.testing li.lang-javascript'); // [&lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;]
</pre>

<p>
子选择器
</p>
<pre>
$('ul.lang&gt;li.lang-javascript'); // 可以选出[&lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;]
$('div.testing&gt;li.lang-javascript'); // [], 无法选出，因为&lt;div&gt;和&lt;li&gt;不构成父子关系
</pre>

<p>
这些语法都是css选择中的高级语法，这里都略过了。
</p>

<p>
jquery对象有下面这些属性:
</p>

<dl class="org-dl">
<dt>find()</dt><dd>进一步查找</dd>
<dt>parent()</dt><dd>获得父节点</dd>
<dt>next()</dt><dd>同一层级下一个节点</dd>
<dt>prev()</dt><dd>同一层级前一个节点</dd>
<dt>filter()</dt><dd>过滤掉某些节点</dd>
</dl>
<p>
上面这几个方法都可以接受和之前描述一样的css选择语法。
</p>

<hr >

<dl class="org-dl">
<dt>text()</dt><dd>本jquery对象标签元素所含文本</dd>
<dt>html()</dt><dd>该jquery对象标签元素所含html</dd>
</dl>

<hr >
<dl class="org-dl">
<dt>css()</dt><dd>修改css属性</dd>
</dl>
<pre>
$('#test-css li.dy&gt;span').css('background-color', '#ffd351').css('color', 'red');
</pre>

<pre>
var div = $('#test-div');
div.hasClass('highlight'); // false， class是否包含highlight
div.addClass('highlight'); // 添加highlight这个class
div.removeClass('highlight'); // 删除highlight这个class
</pre>

<dl class="org-dl">
<dt>attr()</dt><dd>修改属性</dd>
<dt>removeAttr()</dt><dd>删除属性</dd>
</dl>
<pre>
// &lt;div id="test-div" name="Test" start="1"&gt;...&lt;/div&gt;
var div = $('#test-div');
div.hasAttr('name'); // true
div.attr('name'); // 'Test'
div.attr('name', 'Hello'); // div的name属性变为'Hello'
div.removeAttr('name'); // 删除name属性
div.attr('name'); // undefined
</pre>

<dl class="org-dl">
<dt>val()</dt><dd>获取某个表单元素input的value值</dd>
</dl>


<hr >

<dl class="org-dl">
<dt>append()</dt><dd>添加一个子节点</dd>
<dt>prepend()</dt><dd>添加一个子节点，到最前。</dd>
<dt>before()</dt><dd>某个节点之前插入</dd>
<dt>after()</dt><dd>某个节点之后插入</dd>
<dt>remove()</dt><dd>删除某个节点</dd>
</dl>
</div>


<div class="outline-3">
<h3 id="orgheadline1">显示或隐藏</h3>
<div class="outline-text-3" id="text-1-1">
<pre>
var a = $('a[target=_blank]');
a.hide(); // 隐藏
a.show(); // 显示
</pre>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline6">事件</h3>
<div class="outline-text-3" id="text-1-2">
<p>
超链接被点击就触发了click事件，某个标签元素可以如下定义:
</p>
<pre>
a.on('click', function () {
    alert('Hello!');
});
</pre>

<p>
<code>on</code> 某个事件，则执行某个动作。
或者:
</p>
<pre>
a.click(function () {
    alert('Hello!');
});
</pre>
</div>


<div class="outline-4">
<h4 id="orgheadline2">鼠标事件</h4>
<div class="outline-text-4" id="text-1-2-1">
<dl class="org-dl">
<dt>click</dt><dd>鼠标单击时触发；</dd>
<dt>dblclick</dt><dd>鼠标双击时触发；</dd>
<dt>mouseenter</dt><dd>鼠标进入时触发；</dd>
<dt>mouseleave</dt><dd>鼠标移出时触发；</dd>
<dt>mousemove</dt><dd>鼠标在DOM内部移动时触发 （接受e ，e.pageX是鼠标x值，e.pageY是鼠标Y值）</dd>
<dt>hover</dt><dd>鼠标进入和退出时触发两个函数，相当于mouseenter加上mouseleave。</dd>
</dl>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline3">键盘事件</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
键盘事件仅作用在当前焦点的DOM上，通常是&lt;input&gt;和&lt;textarea&gt;。
</p>

<dl class="org-dl">
<dt>keydown</dt><dd>键盘按下时触发；</dd>
<dt>keyup</dt><dd>键盘松开时触发；</dd>
<dt>keypress</dt><dd>按一次键后触发。</dd>
</dl>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline4">其他事件</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
focus：当DOM获得焦点时触发；
blur：当DOM失去焦点时触发；
change：当&lt;input&gt;、&lt;select&gt;或&lt;textarea&gt;的内容改变时触发；
submit：当&lt;form&gt;提交时触发；
ready：当页面被载入并且DOM树完成初始化后触发。
</p>

<p>
文档初始化事件: 
</p>
<pre>
$(function () {
    // init...
});
</pre>
<p>
这种写法就是处理document的ready事件的。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline5">取消某个事件绑定</h4>
<div class="outline-text-4" id="text-1-2-4">
<pre>
a.off('click', hello);
</pre>
</div>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline7">ajax函数</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>$.ajax()</code> 提供ajax支持。
</p>
</div>
</div>
</div>




<div class="outline-2">
<h2 id="orgheadline11">json</h2>
<div class="outline-text-2" id="text-2">
<p>
json之前了解过一些了:
</p>
<pre>
number：和JavaScript的number完全一致；
boolean：就是JavaScript的true或false；
string：就是JavaScript的string；
null：就是JavaScript的null；
array：就是JavaScript的Array表示方式——[]；
object：就是JavaScript的{ ... }表示方式。
</pre>
</div>

<div class="outline-3">
<h3 id="orgheadline9">stringify函数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
某个javascript对象字符串化。
</p>
<pre>
JSON.stringify(xiaoming, null, '  ');
</pre>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline10">parse函数</h3>
<div class="outline-text-3" id="text-2-2">
<p>
将某个javascript对象刷成json对象。
</p>
<pre>
JSON.parse('[1,2,3,true]');
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
